/* CA Email greeting Subject Header when CA is available */
"%1$@ Certificate Authority is now available" = "Varmentaja %1$@ on nyt käytettävissä";

/* %1$@'s CA */
"%1$@'s CA" = "Varmentaja %1$@";

/* Email message sent to the CA when a user requests a Cert */
"%@ has sent you a certificate request. Click the enclosure to complete the request. A certificate signing request (CSR) is information generated by the computer to identify the user requesting a certificate from a Certificate Authority. The CSR contains the public key of the user and is used to generate the certificate. The certificate will automatically be sent to %@.\n\n" = "%1$@ on lähettänyt sinulle varmennepyynnön. Vastaa pyyntöön osoittamalla liitettä. Varmenteenallekirjoituspyyntö on tietokoneen luoma tieto varmennetta pyytävän käyttäjän tunnistamiseen. Pyyntö sisältää käyttäjän julkisen avaimen ja sitä käytetään varmenteen luomiseen. Varmenne lähetetään automaattisesti henkilölle %2$@.\n\n";

/* Email message sent to the user when the CA has created their cert */
"%@ has sent you the certificate you requested. Click the enclosure and Keychain Access will import it for you.\n\n" = "%@ on lähettänyt pyytämäsi varmenteen. Osoita liitettä ja Avainnipun käyttö -ohjelma tuo varmenteen.\n\n";

/* (Unused) */
"(Unused)" = "(Ei käytössä)";

/* 1024 bits */
"1024 bits" = "1024 bittiä";

/* 1200 bits */
"1200 bits" = "1200 bittiä";

/* 1400 bits */
"1400 bits" = "1400 bittiä";

/* 1600 bits */
"1600 bits" = "1600 bittiä";

/* 2048 bits */
"2048 bits" = "2048 bittiä";

/* 256 bits */
"256 bits" = "256 bittiä";

/* 384 bits */
"384 bits" = "384 bittiä";

/* 512 bits */
"512 bits" = "512 bittiä";

/* 521 bits */
"521 bits" = "521 bittiä";

/* <invalid expiration date> */
"<invalid expiration date>" = "<virheellinen vanhenemispäiväys>";

/* <no certificates specified> */
"<no certificates specified>" = "<ei määriteltyjä varmenteita>";

/* _renamed_%d */
"_renamed_%d" = "_renamed_%d";

/* A CA that does not rely on another CA for its validation is called a \\U201Croot\\U201D (or \\U201Canchor\\U201D) CA. A CA that does rely on another CA for its validation is called a \\U201CIntermediate CA\\U201D. Trust in such a root CA must be established by means other than a certificate. Mac OS X contains a list of acceptable root CA identities that have been pre-qualified by Apple. You can add other CAs to this list using the Keychain Access application, or your administrator can do this for you. */
"A CA that does not rely on another CA for its validation is called a \\U201Croot\\U201D (or \\U201Canchor\\U201D) CA. A CA that does rely on another CA for its validation is called a \\U201CIntermediate CA\\U201D. Trust in such a root CA must be established by means other than a certificate. Mac OS X contains a list of acceptable root CA identities that have been pre-qualified by Apple. You can add other CAs to this list using the Keychain Access application, or your administrator can do this for you." = "Varmentaja, joka ei ole riippuvainen toisesta varmentajasta varmistusta varten, on nimeltään ”juurivarmentaja”. Varmentaja, joka on riippuvainen toisesta varmentajasta varmistusta varten, on nimeltään ”välivarmentaja”. Luottamus juurivarmentajaan on muodostettava muilla keinoin kuin varmenteella. Mac OS X sisältää luettelon Applen hyväksymistä juurivarmentajista. Voit lisätä muita varmentajia tähän luetteloon Avainnipun käyttö -ohjelmalla tai pyytää ylläpitäjää tekemään sen puolestasi.";

/* A CA Web Site is provided for users who wish to use the Internet to download a CA invitation and a CA's certificates. The Web Site is mainly provided for users who may not have officially received an invite or the CA certificates from the CA. The Web Site also provides information so user can verify that the site does belong to the CA. The SHA-1 fingerprint of the CA certificate and the CA's administration e-mail address are displayed for verification. */
"A CA Web Site is provided for users who wish to use the Internet to download a CA invitation and a CA's certificates. The Web Site is mainly provided for users who may not have officially received an invite or the CA certificates from the CA. The Web Site also provides information so user can verify that the site does belong to the CA. The SHA-1 fingerprint of the CA certificate and the CA's administration e-mail address are displayed for verification." = "Varmentajan verkkosivusto on tarkoitettu käyttäjille, jotka haluavat ladata varmentajakutsut ja varmentajan varmenteet internetin kautta. Verkkosivusto on tarkoitettu ensisijaisesti käyttäjille, jotka eivät ole saaneet varmentajalta kutsua tai varmentajan varmenteita. Verkkosivusto sisältää myös tietoja, joiden avulla käyttäjät voivat varmistaa, että sivusto kuuluu varmentajalle. Varmentajan varmenteen SHA1-sormenjälki ja varmentajan sähköpostiosoite näytetään varmistamista varten.";

/* A certificate authority (CA) that relies on another CA for its validation is called an Intermediate CA. An intermediate CA depends on the CA that issued it for its validity, and can be invalidated, or revoked, by it. Intermediate CAs are commonly used by their issuing CA to delegate authority for a subset of its operation, such as a particular usage or class of users. If you or your system trusts an intermediate CA's issuer, it will also trust the intermediate CA, unless you explicitly override this. Mac OS X also allows you to directly assign trust to an intermediate CA without trusting its issuer; however, this circumvents validity checks based on the issuer's authority. When creating an intermediate CA with the Certificate Assistant, an existing root or intermediate CA (along with their corresponding private key) must be present to sign it. */
"A certificate authority (CA) that relies on another CA for its validation is called an Intermediate CA. An intermediate CA depends on the CA that issued it for its validity, and can be invalidated, or revoked, by it. Intermediate CAs are commonly used by their issuing CA to delegate authority for a subset of its operation, such as a particular usage or class of users. If you or your system trusts an intermediate CA's issuer, it will also trust the intermediate CA, unless you explicitly override this. Mac OS X also allows you to directly assign trust to an intermediate CA without trusting its issuer; however, this circumvents validity checks based on the issuer's authority. When creating an intermediate CA with the Certificate Assistant, an existing root or intermediate CA (along with their corresponding private key) must be present to sign it." = "Varmentaja, joka on riippuvainen toisesta varmentajasta varmistusta varten, on nimeltään ”välivarmentaja”. Välivarmentajan kelvollisuus riippuu sen luoneesta varmentajasta ja varmentaja voi perua sen kelvollisuuden. Varmentajat voivat siirtää välivarmentajalle osan tehtävistään, kuten tietyn käytön tai käyttäjäryhmän palvelemisen. Jos järjestelmä luottaa varmentajaan, se luottaa myös tämän välivarmentajaan, jollei tätä luottamusta varta vasten kumota. Mac OS X mahdollistaa myös välivarmentajaan luottamisen luottamatta sen varmentajaan, mutta tämä kumoaa varmentajan kelvollisuuteen perustuvat tarkistukset. Kun luot välivarmentajan Varmenneapurilla, olemassa olevan juuri- tai välivarmentajan (sekä vastaavan yksityisen avaimen) on oltava läsnä sen allekirjoittamista varten.";

/* A CA Configuration File already exists with that name. Please pick a different name. */
"A Certificate Authority configuration file already exists with that name. Please pick a different name." = "Samanniminen varmentajan määrittelytiedosto on jo olemassa. Valitse toinen nimi.";

/* A certificate authority name cannot contain periods. */
"A certificate authority name cannot contain periods." = "Varmentajan nimessä ei voi olla pisteitä.";

/* A leaf is a certificate signed by an intermediate or root Certificate Authority. A leaf certificate benefits from the security of certificate chains and certificate policies. A leaf is situated at the bottom of a certificate chain. */
"A leaf is a certificate signed by an intermediate or root Certificate Authority. A leaf certificate benefits from the security of certificate chains and certificate policies. A leaf is situated at the bottom of a certificate chain." = "Käyttäjävarmenne on juuri- tai välivarmentajan allekirjoittama varmenne. Käyttäjävarmenne hyötyy varmenneketjujen ja -käytäntöjen turvallisuudesta. Käyttäjävarmenne sijaitsee varmenneketjun loppupäässä.";

/* A self-signed certificate does not provide the security guarantee of a certificate issued by a Certificate Authority. Before your self-signed certificate is accepted, the recipient will be asked to confirm that they wish to trust and accept it. */
"A self-signed certificate does not provide the security guarantee of a certificate issued by a Certificate Authority. Before your self-signed certificate is accepted, the recipient will be asked to confirm that they wish to trust and accept it." = "Itseallekirjoitettu varmenne ei takaa turvallisuutta kuten varmentajan myöntämä varmenne. Ennen kuin itseallekirjoitettu varmenne hyväksytään, sen vastaanottajaa pyydetään varmistamaan, että he luottavat varmenteeseen ja hyväksyvät sen.";

/* A self-signed certificate is a root certificate authority that someone makes for immediate use as a certificate. Such certificates do not benefit from the security of certificate chains and certificate policies. Most computers will not accept a self-signed certificate unless their owner first tells them to, and some computers will not accept them under any circumstances. They are however easy and quick to make, and are often used for testing purposes in place of certificates signed by proper certificate authorities. */
"A self-signed root certificate is a root certificate authority that someone makes for immediate use as a certificate. Such certificates do not benefit from the security of certificate chains and certificate policies. Most computers will not accept a self-signed certificate unless their owner first tells them to, and some computers will not accept them under any circumstances. They are however easy and quick to make, and are often used for testing purposes in place of certificates signed by proper certificate authorities." = "Itseallekirjoitettu varmenne on juurivarmentaja, jonka joku on tehnyt välittömään käyttöön varmenteena. Tällaiset varmenteet eivät hyödy varmenneketjujen ja -käytäntöjen turvallisuudesta. Useimmat tietokoneet eivät hyväksy itseallekirjoitettuja varmenteita ellei käyttäjä käske niiden hyväksyä ja jotkin tietokoneet eivät hyväksy niitä missään tilanteessa. Niitä on kuitenkin helppo ja nopea tehdä ja niitä käytetään usein testauksessa varmentajan allekirjoittaman varmenteen tilalla.";

/* A URI cannot contain Unicode characters. */
"A URI cannot contain Unicode characters." = "Osoite ei voi sisältää Unicode-merkkejä.";

/* Aborted */
"Aborted" = "Keskeytetty";

/* An error occurred when attempting to display the certificate. */
"An error occurred when attempting to display the certificate." = "Yritettäessä näyttää varmennetta tapahtui virhe.";

/* An error occurred when attempting to evaluate the certificate. */
"An error occurred when attempting to evaluate the certificate." = "Yritettäessä arvioida varmennetta tapahtui virhe.";

/* An error occurred when attempting to install the \\U201C%@\\U201D certificates. */
"An error occurred when attempting to install the \\U201C%@\\U201D certificates." = "Asennettaessa varmenteita ”%@” tapahtui virhe.";

/* An error occurred when creating the e-mail invitation. */
"An error occurred when creating the e-mail invitation." = "Luotaessa sähköpostikutsua tapahtui virhe.";

/* An error occurred when e-mailing the certificate signing request to the CA. Make sure you have a configured e-mail account. */
"An error occurred when e-mailing the certificate signing request to the CA. Make sure you have a configured e-mail account." = "Luotaessa varmenteen allekirjoituspyyntöä tapahtui virhe. Varmista, että olet määritellyt sähköpostitunnuksen.";

/* Message indicating we couldn't mail the CSR to the CA */
"An error occurred when mailing the certificate signing request to the certificate authority." = "Lähetettäessä varmenteen allekirjoituspyyntöä tapahtui virhe.";

/* An error occurred when trying to create the CA web site (error=%d). */
"An error occurred when trying to create the CA web site (error=%d)." = "Luotaessa varmentajan verkkosivustoa tapahtui virhe (virhe = %d).";

/* An error occurred when trying to create the CA web site on your iDisk. Your iDisk could not be accessed. */
"An error occurred when trying to create the CA web site on your iDisk. Your iDisk could not be accessed." = "Luotaessa varmentajan verkkosivustoa iDiskille tapahtui virhe. iDiskiä ei voitu käyttää.";

/* An error occurred when trying to create the CA web site on your iDisk. Your iDisk was not responding. Please check your network connection. */
"An error occurred when trying to create the CA web site on your iDisk. Your iDisk was not responding. Please check your network connection." = "Luotaessa varmentajan verkkosivustoa iDiskille tapahtui virhe. iDisk ei vastaa. Tarkista verkkoyhteys.";

/* An error occurred when verifying the signature that signed \\U201C%@\\U201D. */
"An error occurred when verifying the signature that signed \\U201C%@\\U201D." = "Tarkistettaessa kohteen ”%@” allekirjoitusta tapahtui virhe.";

/* An error occurred when visiting the CA web site. */
"An error occurred when visiting the CA web site." = "Vierailtaessa varmentajan verkkosivustolla tapahtui virhe.";

/* An error occurred. The specified CA wasn't a valid Certificate Authority. */
"An error occurred. The specified CA wasn't a valid Certificate Authority." = "Määritelty varmentaja on virheellinen.";

/* An expiration period for a certificate must be no longer than %d years. */
"An expiration period for a certificate must be no longer than %d years." = "Varmenteen vanhenemisaika ei voi olla enempää kuin %d vuotta.";

/* An invitation is a file given to users who wish to request a certificate from a CA. When done creating a CA, the Certificate Assistant helps you with the delivery of the invitation to the users. A user can double-click on this invitation and the Certificate Assistant will guide them through the process of requesting a certificate. */
"An invitation is a file given to users who wish to request a certificate from a CA. When done creating a CA, the Certificate Assistant helps you with the delivery of the invitation to the users. A user can double-click on this invitation and the Certificate Assistant will guide them through the process of requesting a certificate." = "Kutsu on tiedosto, joka annetaan käyttäjille, jotka haluavat pyytää varmennetta varmentajalta. Kun Varmenneapuri on luonut varmentajan, se auttaa sinua toimittamaan kutsun käyttäjille. Käyttäjä voi kaksoisosoittaa kutsua ja Varmenneapuri ohjaa heidät varmenteen pyytämisprosessin läpi.";

/* IPAddr format not correct */
"An IP Address you specified was not in the correct format (IP Addresses are formatted like 1.2.3.4)." = "Määritellyn IP-osoitteen muoto on virheellinen (IP-osoitteet ovat muotoa 1.2.3.4).";

/* An unknown error occurred when reading the certificate signing request. */
"An unknown error occurred when reading the certificate signing request." = "Luettaessa varmenteen allekirjoituspyyntöä tapahtui odottamaton virhe.";

/* Appropriate S/MIME ExtendedKeyUsage not found  */
"Appropriate S/MIME ExtendedKeyUsage not found " = "Sopivaa S/MIME ExtendedKeyUsagea ei löytynyt ";

/* Bad cert obtained from specified issuerAltName */
"Bad cert obtained from specified issuerAltName" = "Virheellinen varmenne määritellystä issuerAltNamesta";

/* Bad leaf cert */
"Bad leaf cert" = "Virheellinen käyttäjävarmenne";

/* Bad root cert (fails to self-verify) */
"Bad root cert (fails to self-verify)" = "Virheellinen juurivarmenne (ei tarkista itseään)";

/* Basic Constraints Extension */
"Basic Constraints Extension" = "Perusrajoitusten laajennus";

/* Basic Constraints Extension For This CA */
"Basic Constraints Extension For This CA" = "Varmentajan perusrajoitusten laajennus";

/* Basic Constraints Extension For Users of This CA */
"Basic Constraints Extension For Users of This CA" = "Varmentajan käyttäjien perusrajoitusten laajennus";

/* Basic Constraints Missing */
"Basic Constraints Missing" = "Perusrajoitukset puuttuvat";

/* Cancel */
"Cancel" = "Kumoa";

/* Cert expired */
"Cert expired" = "Varmenne vanhentunut";

/* Cert not found at specified issuerAltName */
"Cert not found at specified issuerAltName" = "Varmennetta ei löytynyt määritellystä issuerAltNamesta";

/* Cert not yet valid */
"Cert not yet valid" = "Varmenne ei vielä voimassa";

/* Certificate Request */
"Certificate Request" = "Varmennepyyntö";

/* Choose */
"Choose" = "Valitse";

/* Choose an identity that will sign your CA invitations. */
"Choose an identity that will sign your CA invitations." = "Valitse identiteetti, joka allekirjoittaa varmennekutsut.";

/* Click \\U201CSpecify Alternate Location...\\U201D to create the web site at a different location. */
"Click \\U201CSpecify Alternate Location...\\U201D to create the web site at a different location." = "Jos haluat luoda verkkosivuston eri sijaintiin, osoita Määrittele muu sijainti...";

/* Code Signing, Bad path length */
"Code Signing, Bad path length" = "Koodin allekirjoitus, virheellinen polun pituus";

/* Code Signing, Basic Constraints Missing */
"Code Signing, Basic Constraints Missing" = "Koodin allekirjoitus, perusrajoitukset puuttuvat";

/* Code Signing, Development */
"Code Signing, Development" = "Koodin allekirjoitus, kehitys";

/* Code Signing, Illegal certificate chain length */
"Code Signing, Illegal certificate chain length" = "Koodin allekirjoitus, virheellinen varmenneketjun pituus";

/* Code Signing, No Extended Key Usage */
"Code Signing, No Extended Key Usage" = "Koodin allekirjoitus, ei laajennettua avaimenkäyttöä";

/* Continue */
"Continue" = "Jatka";

/* Could not create a key pair. */
"Could not create a key pair." = "Avainparin luominen epäonnistui.";

/* Could not create the CA configuration file. */
"Could not create the Certificate Authority configuration file." = "Varmentajan määrittelytiedoston luominen epäonnistui.";

/* Could not create the certificate export file (error=%d). */
"Could not create the certificate export file (error=%d)." = "Varmenteen vientitiedostoa ei voitu luoda (virhe = %d).";

/* Could not create the certificate export file. */
"Could not create the certificate export file." = "Varmenteen vientitiedostoa ei voitu luoda.";

/* Could not find a signing key based on the public key hash. */
"Could not find a signing key based on the public key." = "Julkiseen avaimeen perustuvaa allekirjoitusavainta ei löytynyt.";

/* Could not find the issuer for the Certificate Authority configuration file \\U201C%@\\U201D. */
"Could not find the issuer for the Certificate Authority configuration file \\U201C%@\\U201D." = "Varmentajan määrittelytiedoston ”%@” myöntäjää ei löytynyt.";

/* Could not mail the certificate to the user. */
"Could not mail the certificate to the user. A copy has been placed in your keychain." = "Varmennetta ei voitu lähettää käyttäjälle. Kopio varmenteesta on laitettu avainnippuun.";

/* Create Your Certificate */
"Create Your Certificate" = "Luo varmenne";

/* Create Your Certificate Authority */
"Create Your Certificate Authority" = "Luo varmentaja";

/* Creating Key Pair... */
"Creating Key Pair..." = "Luodaan avainparia...";

/* Creating the CA web site... */
"Creating the CA web site..." = "Luodaan varmentajan verkkosivustoa...";

/* Creating the certificate request... */
"Creating the certificate request..." = "Luodaan varmennepyyntöä...";

/* Creating the certificate... */
"Creating the certificate..." = "Luodaan varmennetta...";

/* CRL Expired */
"CRL Expired" = "CRL vanhentunut";

/* CRL failed policy verification */
"CRL failed policy verification" = "CRL ei läpäissyt käytännön tarkistusta";

/* CRL Not Valid Yet */
"CRL Not Valid Yet" = "CRL ei vielä voimassa";

/* CRL not verifiable to anchor or root */
"CRL not verifiable to anchor or root" = "CRL ei ole juuren tarkistettavissa";

/* CRL verified to untrusted root */
"CRL verified to untrusted root" = "CRL:n on tarkistanut ei-luotettu juuri";

/* Done */
"Done" = "Valmis";

/* E-mail addresses cannot contain Unicode characters. */
"E-mail addresses cannot contain Unicode characters." = "Sähköpostiosoitteet eivät voi sisältää Unicode-merkkejä.";

/* Error: could not read the Certificate Authority configuration file. */
"Error: could not read the Certificate Authority configuration file \\U201C%@\\U201D." = "Virhe: varmentajan määrittelytiedoston ”%@” lukeminen epäonnistui.";

/* Error: could not read the specified template \\U201C%@\\U201D. */
"Error: could not read the template \\U201C%@\\U201D." = "Työpohjaa ”%@” ei voitu lukea.";

/* Evaluating Certificate(s) */
"Evaluating Certificate(s)" = "Arvioidaan varmenteita";

/* Expired */
"Expired" = "Vanhentunut";

/* Extended Key Usage Extension */
"Extended Key Usage Extension" = "Laajennettu avaimenkäyttölaajennus";

/* Extended Key Usage Extension For This CA */
"Extended Key Usage Extension For This CA" = "Varmentajan laajennettu avaimenkäyttölaajennus";

/* Extended Key Usage Extension For Users of This CA */
"Extended Key Usage Extension For Users of This CA" = "Varmentajan käyttäjien laajennettu avaimenkäyttölaajennus";

/* For SSL Server certificates, either an IP Address or DNS name must be specified. */
"For SSL Server certificates, either an IP Address or DNS name must be specified." = "SSL-palvelinvarmenteisiin on määriteltävä joko IP-osoite tai DNS-nimi.";

/* For the user who request certificates from this CA, select Extended Key Usage Extension to see the available options and specify which ones their certificate will use. */
"For the user who request certificates from this CA, select Extended Key Usage Extension to see the available options and specify which ones their certificate will use." = "Kun käyttäjä pyytää varmennetta tältä varmentajalta, katso käytettävissä olevat vaihtoehdot valitsemalla Laajennettu avaimenkäyttölaajennus ja määrittele mitä niistä varmenne käyttää.";

/* For the user who request certificates from this CA, select Include Basic Constraints Extension to see the available options and specify which ones their certificate will use. */
"For the user who request certificates from this CA, select Include Basic Constraints Extension to see the available options and specify which ones their certificate will use." = "Kun käyttäjä pyytää varmennetta tältä varmentajalta, katso käytettävissä olevat vaihtoehdot valitsemalla Sisällytä perusrajoitusten laajennus ja määrittele mitä niistä varmenne käyttää.";

/* For the user who request certificates from this CA, select Include Subject Alternate Name Extension to see the available options and specify which ones their certificate will use. */
"For the user who request certificates from this CA, select Include Subject Alternate Name Extension to see the available options and specify which ones their certificate will use." = "Kun käyttäjä pyytää varmennetta tältä varmentajalta, katso käytettävissä olevat vaihtoehdot valitsemalla Sisällytä kohteen nimilaajennus ja määrittele mitä niistä varmenne käyttää.";

/* For this Certificate Authority, select Include Basic Constraints Extension to see the available options and specify which ones the CA certificate will use. */
"For this Certificate Authority, select Include Basic Constraints Extension to see the available options and specify which ones the CA certificate will use." = "Katso tälle varmentajalle käytettävissä olevat vaihtoehdot valitsemalla Sisällytä perusrajoitusten laajennus ja määrittele mitä niistä varmentaja käyttää.";

/* For this Certificate Authority, select Include Extended Key Usage Extension to see the available options and specify which ones the CA certificate will use. */
"For this Certificate Authority, select Include Extended Key Usage Extension to see the available options and specify which ones the CA certificate will use." = "Katso tälle varmentajalle käytettävissä olevat vaihtoehdot valitsemalla Laajennettu avaimenkäyttölaajennus ja määrittele mitä niistä varmentaja käyttää.";

/* For this Certificate Authority, select Include Subject Alternate Name Extension to see the available options and specify which ones the CA certificate will use. */
"For this Certificate Authority, select Include Subject Alternate Name Extension to see the available options and specify which ones the CA certificate will use." = "Katso tälle varmentajalle käytettävissä olevat vaihtoehdot valitsemalla Sisällytä kohteen nimilaajennus ja määrittele mitä niistä varmentaja käyttää.";

/* Good */
"Good" = "Hyvä";

/* Hostname mismatch */
"Hostname mismatch" = "Palvelinnimi ei sama";

/* Idle */
"Idle" = "Vapaa";

/* Illegible CRL distribution point URI */
"Illegible CRL distribution point URI" = "Lukukelvoton CRL:n jakopisteen osoite";

/* Illegible name */
"Illegible name" = "Lukukelvoton nimi";

/* Intermediate CA */
"Intermediate CA" = "Välivarmentaja";

/* Invalid Authority Key ID  */
"Invalid Authority Key ID " = "Virheellinen varmentajan avaintunnus ";

/* Invalid BasicConstraints.CA */
"Invalid BasicConstraints.CA" = "Virheellinen BasicConstraints.CA";

/* Invalid Certificate */
"Invalid Certificate" = "Virheellinen varmenne";

/* Invalid Extended Key Usage */
"Invalid Extended Key Usage" = "Virheellinen laajennettu avaimenkäyttö";

/* Invalid Key Usage */
"Invalid Key Usage" = "Virheellinen avaimenkäyttö";

/* Invalid Subject Key ID  */
"Invalid Subject Key ID " = "Virheellinen aiheen avaintunnus ";

/* Invalid Subject/Authority Key ID Linkage */
"Invalid Subject/Authority Key ID Linkage" = "Virheellinen aiheen/varmentajan avaintunnusten linkitys";

/* IssuingDistributionPoint extension violation */
"IssuingDistributionPoint extension violation" = "IssuingDistributionPoint-laajennusrikkomus";

/* Key Pair pane title (when not creating a CA) */
"Key Pair Information" = "Avainparitiedot";

/* Key Pair pane title (when creating a CA) */
"Key Pair Information For This CA" = "Tämän varmentajan avainparitiedot";

/* Key Usage Extension */
"Key Usage Extension" = "Avaimenkäyttölaajennus";

/* Key Usage Extension For This CA */
"Key Usage Extension For This CA" = "Tämän varmentajan avaimenkäyttölaajennus";

/* Key Usage Extension For Users of This CA */
"Key Usage Extension For Users of This CA" = "Tämän varmentajan käyttäjien avaimenkäyttölaajennus";

/* Keychain */
"Keychain" = "Avainnippu";

/* Leaf */
"Leaf" = "Käyttäjävarmenne";

/* Let me choose */
"Let me choose" = "Anna minun valita";

/* Network */
"Network" = "Verkko";

/* No */
"No" = "Ei";

/* No certificates were returned from the host. */
"No certificates were returned from the host." = "Palvelin ei palauttanut varmenteita.";

/* No CRL */
"No CRL" = "Ei CRL:tä";

/* No root cert found */
"No root cert found" = "Juurivarmennetta ei löytynyt";

/* Not Yet Valid */
"Not Yet Valid" = "Ei vielä voimassa";

/* Note: Additional certificates that make up the Certificate Authority (CA) must also be provided to users. Additional certificates are located in the .pem file in the CA folder. For added security, don't send these files by email. Make them available in a secure location, such as a file server. */
"Note: Additional certificates that make up the Certificate Authority (CA) must also be provided to users. Additional certificates are located in the .pem file in the CA folder. For added security, don't send these files by email. Make them available in a secure location, such as a file server." = "Huomaa: Käyttäjille on annettava myös varmenteet, joista varmentaja koostuu. Varmenteet sijaitsevat CA-kansiossa olevassa .pem-tiedostossa. Turvallisuuden varmistamiseksi älä lähetä tiedostoja sähköpostilla. Aseta ne saataville turvalliseen sijaintiin, kuten tiedostopalvelimelle.";

/* OK */
"OK" = "OK";

/* P12Password */
"P12Password" = "P12Password";

/* Partial public key resolved with failure */
"Partial public key resolved with failure" = "Osittainen julkinen avain ratkaistiin virheen kera";

/* Partial public key unresolvable */
"Partial public key unresolvable" = "Osittaista julkista avainta ei ratkaistu";

/* PathLengthConstraint exceeded */
"PathLengthConstraint exceeded" = "PathLengthConstraint ylittyi";

/* Please contact your CA administrator for assistance. */
"Please contact your CA administrator for assistance." = "Jos tarvitset apua, ota yhteyttä varmentajan ylläpitäjään.";

/* Please contact your CA administrator for help importing them. */
"Please contact your CA administrator for help importing them." = "Jos tarvitset apua niiden tuomisessa, ota yhteyttä varmentajan ylläpitäjään.";

/* Please specify a serial number from %@ to %@. */
"Please specify a serial number from %@ to %@." = "Määrittele sarjanumero väliltä %1$@ - %2$@.";

/* Please specify a valid expiration date. */
"Please specify a valid expiration date." = "Määrittele kelvollinen vanhenemispäivämäärä.";

/* Please specify some certificate information below: */
"Please specify some certificate information below:" = "Määrittele varmenteen tietoja alla:";

/* Please specify some information about your CA: */
"Please specify some information about your CA:" = "Määrittele tietoja varmentajasta:";

/* Please specify the issuing Certificate Authority for %@\\U2019s (%@) certificate request. */
"Please specify the issuing Certificate Authority for %@\\U2019s (%@) certificate request." = "Määrittele myöntävä varmentaja henkilön %1$@ (%2$@) varmennepyynnölle.";

/* Please specify the issuing Certificate Authority for this certificate request. */
"Please specify the issuing Certificate Authority for this certificate request." = "Määrittele myöntävä varmentaja tällä varmennepyynnölle.";

/* Policy verification failed */
"Policy verification failed" = "Käytännön tarkistus epäonnistui";

/* ProbeSSL */
"ProbeSSL" = "ProbeSSL";

/* Probing SSL server */
"Probing SSL server" = "Tutkitaan SSL-palvelinta";

/* Replace existing \\U201C%@\\U201D web site on your iDisk? */
"Replace existing \\U201C%@\\U201D web site on your iDisk?" = "Korvataanko nykyinen iDiskillä oleva verkkosivusto ”%@”?";

/* Replace existing \\U201C%@\\U201D? */
"Replace existing \\U201C%@\\U201D?" = "Korvataanko nykyinen ”%@”?";

/* Required */
"Required" = "Vaaditaan";

/* Root ALSO in System Roots */
"Root ALSO in System Roots" = "Juuri MYÖS järjestelmän juurissa";

/* S/MIME */
"S/MIME" = "S/MIME";

/* S/MIME Email address mismatch */
"S/MIME Email address mismatch" = "S/MIME-sähköpostiosoite ei sama";

/* S/MIME KeyUsage incompatibility */
"S/MIME KeyUsage incompatibility" = "S/MIME KeyUsage -yhteensopimattomuus";

/* S/MIME, No email Address Found */
"S/MIME, No email Address Found" = "S/MIME, sähköpostiosoitetta ei löytynyt";

/* S/MIME, non-critical KeyUsage */
"S/MIME, non-critical KeyUsage" = "S/MIME, ei-kriittinen avaimenkäyttö";

/* S/MIME, SubjectAltName not critical */
"S/MIME, SubjectAltName not critical" = "S/MIME, SubjectAltName ei kriittinen";

/* Select Include Basic Constraints Extension to see the available options and specify which ones this certificate will use. */
"Select Include Basic Constraints Extension to see the available options and specify which ones this certificate will use." = "Katso käytettävissä olevat valinnat valitsemalla Sisällytä perusrajoitusten laajennus ja valitse ne, joita varmenne käyttää.";

/* Select Include Extended Key Usage Extension to see the available options and specify which ones this certificate will use. */
"Select Include Extended Key Usage Extension to see the available options and specify which ones this certificate will use." = "Katso käytettävissä olevat valinnat valitsemalla Sisällytä laajennettu avaimenkäyttölaajennus ja valitse ne, joita varmenne käyttää.";

/* Select Include Subject Alternate Name Extension to see the available options and specify which ones this certificate will use. */
"Select Include Subject Alternate Name Extension to see the available options and specify which ones this certificate will use." = "Katso käytettävissä olevat valinnat valitsemalla Sisällytä kohteen nimilaajennus ja valitse ne, joita varmenne käyttää.";

/* Select the appropriate trust policy to evaluate \\U201C%1$@\\U201D. */
"Select the appropriate trust policy to evaluate \\U201C%1$@\\U201D." = "Valitse sopiva luottamuskäytäntö kohteen ”%1$@” arvioimiseen.";

/* Self Signed Root */
"Self Signed Root" = "Itseallekirjoitettu juuri";

/* Self Signed Root CA */
"Self Signed Root CA" = "Itseallekirjoitettu juurivarmentaja";

/* Show CA Web Site... */
"Show CA Web Site..." = "Näytä varmentajan verkkosivusto...";

/* Sign using your %@ identity */
"Sign using your %@ identity" = "Allekirjoita käyttäen identiteettiä %@";

/* Specified CRL server down */
"Specified CRL server down" = "Määritelty CRL-palvelin ei käytettävissä rfc822Name";

/* Key Pair pane title when CA configures default key pair values when creating a CA */
"Specify Key Pair Information For Users of This CA" = "Määritä tämän varmentajan käyttäjien avainparitiedot";

/* Key Pair Attributes pane message for creating a CA */
"Specify the key size and algorithm used to create your key pair for the Certificate Authority.\n\nThe key pair is made up of your private and public keys. The private key is the secret part of the key pair and should be kept secret. The public key is made publicly available as part of the digital certificate." = "Määritä avaimen koko ja algoritmi varmentajaa varten luotavalle avainparille.\n\nAvainpari koostuu yksityisestä ja julkisesta avaimesta. Yksityinen avain on avainparin salainen osa eikä sitä pidä kertoa kenellekään. Julkinen avain saatetaan kaikkien saataville osana varmennetta.";

/* Key Pair Attributes pane message for creating a cert for yourself */
"Specify the key size and algorithm used to create your key pair.\n\nThe key pair is made up of your private and public keys. The private key is the secret part of the key pair and should be kept secret. The public key is made publicly available as part of the digital certificate." = "Määritä avaimen koko ja algoritmi luotavalle avainparille.\n\nAvainpari koostuu yksityisestä ja julkisesta avaimesta. Yksityinen avain on avainparin salainen osa eikä sitä pidä kertoa kenellekään. Julkinen avain saatetaan kaikkien saataville osana varmennetta.";

/* SSL Client */
"SSL Client" = "SSL-asiakas";

/* SSL Server */
"SSL Server" = "SSL-palvelin";

/* Subject Alternate Name Extension */
"Subject Alternate Name Extension" = "Kohteen nimilaajennus";

/* Subject Alternate Name Extension For This CA */
"Subject Alternate Name Extension For This CA" = "Varmentajan kohteen nimilaajennus";

/* Subject Alternate Name For Users of This CA */
"Subject Alternate Name For Users of This CA" = "Varmentajan käyttäjien kohteen nimilaajennus";

/* Success */
"Success" = "Onnistui";

/* System Roots */
"System Roots" = "Järjestelmäjuuret";

/* Template = %@ */
"Template = %@" = "Työpohja = %@";

/* CA Email greeting when CA is available */
"The \\U201C%1$@\\U201D Certificate Authority is now available to accept certificate requests from you. Click the attachment and the Certificate Assistant will guide you through this process." = "Varmentaja ”%1$@” voi nyt vastaanottaa varmennepyyntöjä. Osoita liitettä, niin Varmenneapuri ohjaa sinut prosessin läpi.";

/* Conclusion pane when a CA creates a cert and it is sent to the requestor */
"The certificate has been created for \\U201C%1$@\\U201D. A copy has been placed in your keychain." = "Kohteelle ”%1$@” luotiin varmenne. Kopio varmenteesta sijoitettiin avainnippuun.";

/* The default Certificate Authority is now set to \\U201C%@\\U201D. */
"The default Certificate Authority is now set to \\U201C%@\\U201D." = "Oletusvarmentaja on nyt ”%@”.";

/* The file you specified could not be opened by this assistant. */
"The file you specified could not be opened by this assistant." = "Apuri ei voinut avata määrittelemääsi tiedostoa.";

/* The Key Usage Extension of a certificate identifies its security capabilities. Select Include Key Usage Extension to see the available capabilities, and select which ones this certificate will provide. */
"The Key Usage Extension of a certificate identifies its security capabilities. Select Include Key Usage Extension to see the available capabilities, and select which ones this certificate will provide." = "Varmenteen avaimenkäyttölaajennus määrittelee varmenteen suojausominaisuudet. Katso käytettävissä olevat ominaisuudet valitsemalla Sisällytä avaimenkäyttölaajennus ja valitse ominaisuudet, jotka varmenne tarjoaa.";

/* The Key Usage Extension of the CA\\U2019s certificate identifies its security capabilities. Select Include Key Usage Extension to see the available capabilities, and select which ones the certificate will provide. */
"The Key Usage Extension of the CA\\U2019s certificate identifies its security capabilities. Select Include Key Usage Extension to see the available capabilities, and select which ones the certificate will provide." = "Varmentajan varmenteen avaimenkäyttölaajennus määrittelee varmenteen suojausominaisuudet. Katso käytettävissä olevat ominaisuudet valitsemalla Sisällytä avaimenkäyttölaajennus ja valitse ominaisuudet, jotka varmenne tarjoaa.";

/* The Key Usage Extension of the user's certificate identifies its security capabilities. Select Include Key Usage Extension to see the available capabilities, and select which ones their certificate will provide. */
"The Key Usage Extension of the user\\U2019s certificate identifies its security capabilities. Select Include Key Usage Extension to see the available capabilities, and select which ones their certificate will provide." = "Käyttäjien varmenteen avaimenkäyttölaajennus määrittelee varmenteen suojausominaisuudet. Katso käytettävissä olevat ominaisuudet valitsemalla Sisällytä avaimenkäyttölaajennus ja valitse ominaisuudet, jotka varmenne tarjoaa.";

/* The RFC822 name cannot contain Unicode characters. */
"The RFC822 name cannot contain Unicode characters." = "RFC822-nimi ei voi sisältää Unicode-merkkejä.";

/* There are currently no identities available to sign your CA invitation. */
"There are currently no identities available to sign your CA invitation." = "Varmentajakutsun allekirjoittamiseen ei ole käytettävissä identiteettejä.";

/* There are no configured Certificate Authorities. You first need to create one using the 'Create a Certificate Authority' option. */
"There are no configured Certificate Authorities. You first need to create one using the \\U201CCreate a Certificate Authority\\U201D option." = "Varmentajia ei ole määritelty. Ensin on luotava varmentaja ”Luo varmentaja” -vaihtoehdon avulla.";

/* There are no configured Certificate Authorities. You first need to create one. */
"There are no configured Certificate Authorities. You first need to create one." = "Käytettävissä ei ole yhtään määriteltyä varmentajaa. Luo ensin varmentaja.";

/* There are no valid root or intermediate certificate authorities available to sign certificates. Use the \\U201CCreate a Certificate Authority\\U201D option to create a certificate authority. */
"There are no valid root or intermediate certificate authorities available to sign certificates. Use the \\U201CCreate a Certificate Authority\\U201D option to create a certificate authority." = "Yhtään kelvollista juuri- tai välivarmentajaa ei ole käytettävissä varmenteiden allekirjoittamista varten. Luo varmentaja käyttäen Luo varmentaja -vaihtoehtoa.";

/* Key Pair Attributes pane message for specifying key pair information for users of this CA (displayed when creating a CA) */
"This pane will specify the public and private key pair information for users of this CA when they request a certificate." = "Tämä paneeli määrittelee tämän varmentajan käyttäjien avainparin tiedot, kun he pyytävät varmennetta.";

/* To evaluate certificates, first select the appropriate trust policy. */
"To evaluate certificates, first select the appropriate trust policy." = "Jos haluat arvioida varmenteita, valitse ensin sopiva luottamuskäytäntö.";

/* Message indicating that this item is dated today */
"Today" = "Tänään";

/* Trusted Root */
"Trusted Root" = "Luotettu juuri";

/* Trusting a CA certificate means the CA can \\U201Ctrusted\\U201D in the future to perform evaluations on certificates that are signed by this CA and determine whether they are valid or not. When creating a new CA, its certificate is never considered trusted on the system by default for security reasons. Trusting a new CA certificate has to be done specifically by the user or administrator. In this case, it can be trusted by clicking \\U201COn this machine, trust certificates signed by this CA\\U201D. */
"Trusting a CA certificate means the CA can \\U201Ctrusted\\U201D in the future to perform evaluations on certificates that are signed by this CA and determine whether they are valid or not. When creating a new CA, its certificate is never considered trusted on the system by default for security reasons. Trusting a new CA certificate has to be done specifically by the user or administrator. In this case, it can be trusted by clicking \\U201COn this machine, trust certificates signed by this CA\\U201D." = "Varmentajavarmenteeseen luottaminen tarkoittaa, että varmentajan voidaan luottaa jatkossa arvioivan, ovatko tämän varmentajan allekirjoittamat varmenteet kelvollisia vai eivät. Kun uusi varmentaja luodaan, sen varmenteeseen ei koskaan luoteta oletuksena turvallisuussyistä. Käyttäjän tai ylläpitäjän on erikseen ilmaistava luottavansa varmentajavarmenteeseen. Tässä tapauksessa se voidaan tehdä osoittamalla ”Luota tällä tietokoneella tämän varmentajan allekirjoittamiin varmenteisiin”.";

/* Unknown (Internal error) */
"Unknown (Internal error)" = "Tuntematon (sisäinen virhe)";

/* Unknown Critical Cert Extension */
"Unknown Critical Cert Extension" = "Tuntematon kriittinen varmennelaajennus";

/* Unknown Critical CRL Extension */
"Unknown Critical CRL Extension" = "Tuntematon kriittinen CRL-laajennus";

/* Unknown Critical Extension */
"Unknown Critical Extension" = "Tuntematon kriittinen laajennus";

/* Unknown Error = %1$@ */
"Unknown Error = %1$@" = "Tuntematon virhe = %1$@";

/* Unrecognized root cert */
"Unrecognized root cert" = "Tunnistamaton juurivarmenne";

/* Untrusted Root */
"Untrusted Root" = "Ei-luotettu juuri";

/* User Certificate: */
"User Certificate:" = "Käyttäjän varmenne:";

/* VPN Client */
"VPN Client" = "VPN-asiakas";

/* VPN Server */
"VPN Server" = "VPN-palvelin";

/* What does \\U201CMake this CA the default\\U201D mean? */
"What does \\U201CMake this CA the default\\U201D mean?" = "Mitä tarkoittaa ”Aseta oletusvarmentajaksi”?";

/* What does \\U201CSign your invitation\\U201D mean? */
"What does \\U201CSign your invitation\\U201D mean?" = "Mitä tarkoittaa ”Allekirjoita kutsu”?";

/* What does \\U201Ctrust certificates signed by this CA\\U201D mean? */
"What does \\U201Ctrust certificates signed by this CA\\U201D mean?" = "Mitä tarkoittaa ”Luota tämän varmentajan allekirjoittamiin varmenteisiin”?";

/* What is a CA Web Site? */
"What is a CA Web Site?" = "Mikä on varmentajan verkkosivusto?";

/* What is a leaf certificate? */
"What is a leaf certificate?" = "Mikä on käyttäjävarmenne?";

/* What is a self-signed root CA? */
"What is a self-signed root CA?" = "Mikä on itseallekirjoitettu juurivarmentaja?";

/* What is a self-signed root certificate? */
"What is a self-signed root certificate?" = "Mikä on itseallekirjoitettu juurivarmenne?";

/* What is an intermediate certificate authority? */
"What is an intermediate certificate authority?" = "Mikä on välivarmentaja?";

/* What is an invitation? */
"What is an invitation?" = "Mikä on kutsu?";

/* When a user requests a certificate from a CA, a signed invitation ensures the user that the invitation is in fact from this CA and is unaltered. */
"When a user requests a certificate from a CA, a signed invitation ensures the user that the invitation is in fact from this CA and is unaltered." = "Kun käyttäjä pyytää varmennetta varmentajalta, allekirjoitettu kutsu varmistaa käyttäjälle, että kutsu on todella kyseiseltä varmentajalta ja että sitä ei ole muuteltu.";

/* When accepting certificate signing requests from users, the default CA will be automatically selected in the popup menu of available Certificate Authorities. When you click \\U201CMake this CA the default\\U201D, the CA name you have specified above will become the default CA. */
"When accepting certificate signing requests from users, the default CA will be automatically selected in the popup menu of available Certificate Authorities. When you click \\U201CMake this CA the default\\U201D, the CA name you have specified above will become the default CA." = "Kun hyväksyt varmenteiden allekirjoituspyyntöjä käyttäjiltä, oletusvarmentaja on automaattisesti valittuna käytettävissä olevien varmentajien ponnahdusvalikossa. Kun osoitat ”Aseta oletusvarmentajaksi”, yllä määritellystä varmentajasta tulee oletusvarmentaja.";

/* Yes */
"Yes" = "Kyllä";

/* Message indicating that this item is dated yesterday */
"Yesterday" = "Eilen";

/* You are about to create a root certificate authority that will issue S/MIME certificates. The key pair created will be 2048-bit RSA. If you want to change these defaults, click \\U201CLet me override defaults.\\U201D */
"You are about to create a root certificate authority that will issue S/MIME certificates. The key pair created will be 2048-bit RSA. If you want to change these defaults, click \\U201CLet me override defaults.\\U201D" = "Olet luomassa juurivarmentajaa, joka myöntää S/MIME-varmenteita. Luotava avainpari on 2048-bittinen RSA. Jos haluat muuttaa näitä oletusarvoja, osoita ”Salli oletusarvojen ohittaminen”.";

/* You are about to create a secure e-mail (S/MIME) certificate. The key pair created will be 2048-bit RSA. If you want to change these defaults, click \\U201CLet me override defaults.\\U201D */
"You are about to create a secure e-mail (S/MIME) certificate. The key pair created will be 2048-bit RSA. If you want to change these defaults, click \\U201CLet me override defaults.\\U201D" = "Olet luomassa suojattua sähköpostivarmennetta (S/MIME). Luotava avainpari on 2048-bittinen RSA. Jos haluat muuttaa näitä oletusarvoja, osoita ”Salli oletusarvojen ohittaminen”.";

/* You are about to create a self-signed certificate. */
"You are about to create a self-signed certificate." = "Olet luomassa itseallekirjoitettua varmennetta.";

/* You are about to create an intermediate certificate authority that will issue S/MIME certificates. The key pair created will be 2048-bit RSA. If you want to change these defaults, click \\U201CLet me override defaults.\\U201D */
"You are about to create an intermediate certificate authority that will issue S/MIME certificates. The key pair created will be 2048-bit RSA. If you want to change these defaults, click \\U201CLet me override defaults.\\U201D" = "Olet luomassa välivarmentajaa, joka myöntää S/MIME-varmenteita. Luotava avainpari on 2048-bittinen RSA. Jos haluat muuttaa näitä oletusarvoja, osoita ”Salli oletusarvojen ohittaminen”.";

/* You are required to choose at least one extended key usage if this extension is enabled. */
"You are required to choose at least one extended key usage if this extension is enabled." = "Jos tämä laajennus on käytössä, sinun on valittava vähintään yksi laajennettu avaimen käyttö.";

/* You are required to choose at least one key usage if this extension is enabled. */
"You are required to choose at least one key usage if this extension is enabled." = "Jos tämä laajennus on käytössä, sinun on valittava vähintään yksi avaimen käyttö.";

/* Error sheet message when faling to specify a name for the CA config file */
"You must enter a configuration file name before continuing." = "Syötä nimi määrittelytiedostolle ennen jatkamista.";

/* Error sheet message when faling to specify an email address */
"You must enter an email address for the user before continuing." = "Syötä käyttäjälle sähköpostiosoite ennen jatkamista.";

/* Error sheet message when faling to specify an email address of the CA */
"You must enter an email address of a Certificate Authority before continuing." = "Syötä varmentajalle sähköpostiosoite ennen jatkamista.";

/* Your CA was created successfully. Click 'OK' to begin using your new CA. */
"Your CA was created successfully. Click 'OK' to begin using your new CA." = "Varmentajan luominen on suoritettu. Voit alkaa käyttää uutta varmentajaa osoittamalla OK.";

/* Conclusion pane message for creating and configuring a CA */
"Your Certificate Authority \\U201C%1$@\\U201D has been created and is ready to issue certificates." = "Varmentaja ”%1$@” on luotu ja valmis myöntämään varmenteita.";

/* Conclusion pane when a user issues their own certificate */
"Your certificate has been successfully created." = "Varmenteen luominen onnistui.";

/* Your certificate is ready */
"Your certificate is ready" = "Varmenne on valmis";

/* Conclusion pane message for a user requesting a certificate from a CA */
"Your certificate request Email has been created for you and is ready to send in Mail.app. After you send it, \\U201C%1$@\\U201D will receive an email containing your certificate. When you receive it, click the enclosure and it will be imported into your keychain." = "Varmennepyyntösähköposti on luotu ja se on valmiina lähetettäväksi Mailissa. Kun lähetät sen, ”%1$@” saa sähköpostin, joka sisältää varmenteesi. Kun saat sen, osoita liitettä ja se tuodaan avainnippuusi.";

/* Your certificate request has been created on disk. */
"Your certificate request has been created on disk." = "Varmennepyyntö on luotu levylle.";

/* Your invitation will remain unsigned. */
"Your invitation will remain unsigned." = "Kutsu pysyy allekirjoittamattomana.";

